### Data cleaning

In real world datasets, we come across lot of data quality problems which we sometimes refer as noise. The presence of noise hampers the data processing steps. Some other issues with data are outliers (data different than most of the other data objects in the data set), it interferes the most with the data analysis. There can be missing values, duplicate data or even wrong, inaccurate or fake data.
Therefore, to work with real world dataset we need to do data cleaning.

Some of the techniques for data cleaning are as follows:
1. Handling missing or incomplete data: Missing data can arise as a result of inconsistent data deletion, diregarding data filling in the first place, updation to the historical data and so on. Ignore the missing values if not useful, fill in missing values manually (tedious and infeasible) or automatically with global constant value, replace with central tendency of the data (mean/median, when data is skewed use median to avoid outlier values affecting the mean). It is actually better if the data is filled correctly in the first place by making some fields manadatory and hence future proofing it.
2. Noisy data like random error or variance in a measured variable, say salary is -1. Noisy data might occure due to faulty data collection, data entry issues, data tranmission problems or even technology limitation like one data format gives 3 decimals and other may be 15 decimals.  To handle noisy data generally binning methods are used to smooth the data, outlier detection and removal, another method is to smooth data using regression functions.

Other processes and tools are:
- Use metadata (data about data) (e.g., domain, range, dependency, distribution) – example: what are acceptable values of age by having a valid range specified
- Check field overloading – happens when developers try to squeeze in the data. Example, 32 bits squeezed into 8 bits, mainly development issues
- Check uniqueness rule, consecutiveness rule (no missing values between the lowest and highest values, example, ticket number to be consecutive) , null rule(how to handle empty values, question marks, etc.) for the attributes
- Use tools for data scrubbing and data auditing – uses domain knowledge to automatically detect discrepancies in the dataset
- Use data migration tools – allow transformations to be specified – replace date formats, currencies, etc.
- ETL (extraction/transformation/loading) tools: allow users to specify transformations using GUI

### Below are some examples in python for data cleaning

Remove fields that refer to internal processes at the British Library and do not describe the books themselves (Corporate Author, Corporate Contributors, Issuance type, Former owner, Shelfmarks, Engraver).Clean data in column Date of Publication, as to remove the extra dates in square brackets (e.g. 1879 [1878] -> 1879) and convert date ranges to their start date, wherever present (e.g. 1860-63 -> 1860)

In [3]:
import pandas as pd
import re

#read the csv file
df = pd.read_csv('./BL_books.csv')
df.columns = ['Identifier','Edition Statement','Place of Publication','Date of Publication','Publisher','Title',
                'Author','Contributors','Corporate Author','Corporate Contributors','Former owner',
                'Engraver','Issuance type','Flickr URL','Shelfmarks']

#Inspect the data and describe any issues observed
print('Number of instances = %d' % (df.shape[0]))
print('Number of attributes = %d' % (df.shape[1]))
print('Number of missing values:')
for col in df.columns:
    print('\t%s: %d' % (col,df[col].isna().sum()))

#Remove fields that refer to internal processes at the British Library 
df = df.drop(['Corporate Author','Corporate Contributors','Former owner','Engraver','Issuance type','Shelfmarks'],
             axis=1)

#Clean data in column Date of Publication
df['Date of Publication'] = df['Date of Publication'].str.extract(r'(\d{4})')
df.head() #default is to show 5 rows, we can change it by using data.head(2) to show 2 rows

Number of instances = 8287
Number of attributes = 15
Number of missing values:
	Identifier: 0
	Edition Statement: 7514
	Place of Publication: 0
	Date of Publication: 181
	Publisher: 4195
	Title: 0
	Author: 1778
	Contributors: 0
	Corporate Author: 8287
	Corporate Contributors: 8287
	Former owner: 8286
	Engraver: 8287
	Issuance type: 0
	Flickr URL: 0
	Shelfmarks: 0

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Flickr URL
0,206,NaN,London,1879,S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",http://www.flickr.com/photos/britishlibrary/ta...
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",http://www.flickr.com/photos/britishlibrary/ta...
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",http://www.flickr.com/photos/britishlibrary/ta...
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",http://www.flickr.com/photos/britishlibrary/ta...

Load the CSV file country-income.csv which includes both numerical and categorical values. Perform data cleaning in order to replace any NaN values with the mean of the value for a given field. Then replace any categorical labels with numerical labels. Display the resulting dataset.

In [5]:
import pandas as pd

#Load the CSV file country-income.csv which includes both numerical and categorical values
df = pd.read_csv('./country-income.csv')
df.columns = ['Region','Age','Income','Online Shopper']

#Print the number of missing values for each attribute
print('Number of missing values:')
for col in df.columns:
    print('\t%s: %d' % (col,df[col].isna().sum()))
    
#Data cleaning in order to replace any NaN values with the mean of the value for a given field
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Income'] = df['Income'].fillna(df['Income'].mean())

#Replace any categorical labels with numerical labels

#Print the number of regions and their counts in the dataset
noOfRegions = df['Region'].value_counts()
print('\nNumber of regions: \n{}'.format(noOfRegions))

#country code numbers have been chosen to map the region to numerical value
#for the online shopper as Yes or No, 1 and 0 has been chosen respectively
map_dict = {'Region':{'India':91,'Brazil':55,'USA':1},'Online Shopper':{'Yes':1,'No':0}} 
df.replace(map_dict,inplace=True)

#Display the resulting dataset
df

Number of missing values:
	Region: 0
	Age: 0
	Income: 0
	Online Shopper: 0

Number of regions:
India     4
USA       3
Brazil    3
Name: Region, dtype: int64

   Region  Age  Income  Online Shopper
0      91   49   86400               0
1      55   32   57600               1
2       1   35   64800               0
3      55   43   73200               0
4       1   45   79400               1
5      91   40   69600               1
6      55   46   62400               0
7      91   53   94800               1
8       1   55   99600               0
9      91   42   80400               1